NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK26F18.svd
        <register>
          <name>ANACTRL_TOG</name>
          <description>USB PHY Analog Control Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TESTCLK_SEL</name>
              <description>Test clock selection to analog test</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFD_CLKGATE</name>
              <description>This bit field controls clock gating (disabling) for the PFD pfd_clk output for power savings when the PFD is not used</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PFD clock output is enabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PFD clock output is gated (Default)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD_CLK_SEL</name>
              <description>This bit field for the PFD selects the frequency relationship between the local pfd_clk output and the exported USB1PFDCLK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>USB1PFDCLK is the same frequency as the xtal clock (Default)</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>USB1PFDCLK frequency is pfd_clk divided by 4</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>USB1PFDCLK frequency is pfd_clk divided by 2</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>USB1PFDCLK frequency is the same as pfd_clk frequency</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD_FRAC</name>
              <description>PFD fractional divider setting used to select the pfd_clk output frequency</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEV_PULLDOWN</name>
              <description>Setting this field to 1&apos;b1 will enable the 15kohm pulldown resistors on both USB_DP and USB_DM pins</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare disabled in device mode.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare enabled in device mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMPH_PULSE_CTRL</name>
              <description>Controls pre-emphasis time duration for the High Speed TX drivers after each data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high to 1&apos;b1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Minimum duration of pre-emphasis current after each data transition</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Maximum duration of pre-emphasis current after each data transition</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMPH_EN</name>
              <description>Enables pre-emphasis for the High-Speed TX drivers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No pre-emphasis is used on HS TX output drivers</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables pre-emphasis for HS TX output drivers</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMPH_CUR_CTRL</name>
              <description>Controls the amount of pre-emphasis current added for the High-Speed TX drivers after each data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high to 1&apos;b1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>No pre-emphasis current is enabled for the HS TX drivers</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>One unit of pre-emphasis current is enabled for the HS TX drivers</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Two units of pre-emphasis current are enabled for the HS TX drivers</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Three units of pre-emphasis current are enabled for the HS TX drivers</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFD_STABLE</name>
              <description>PFD stable signal from the Phase Fractional Divider.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_LOOPBACK</name>
          <description>USB PHY Loopback Control/Status Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x550000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>This bit enables the USB loopback test.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_DIG_TST0</name>
              <description>Mode control for USB loopback test</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_DIG_TST1</name>
              <description>Mode control for USB loopback test</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_HS_MODE</name>
              <description>Select HS or FS mode for USB loopback testing</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_LS_MODE</name>
              <description>Set to value 1&apos;b1 to choose LS for USB loopback testing, set to value 1&apos;b0 to choose HS or FS mode which is defined by TSTI1_TX_HS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_EN</name>
              <description>Enable TX for USB loopback test.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_HIZ</name>
              <description>Sets TX Hi-Z for USB loopback test.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMO_DIG_TST0</name>
              <description>This read-only bit is a status bit for USB loopback test results</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UTMO_DIG_TST1</name>
              <description>This read-only bit is a status bit for USB loopback test</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTI_HSFS_MODE_EN</name>
              <description>Setting this bit field to value 1&apos;b1 will enable the loopback test to dynamically change the packet speed</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTPKT</name>
              <description>Selects the packet data byte used for USB loopback testing in Pulse mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_LOOPBACK_SET</name>
          <description>USB PHY Loopback Control/Status Register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x550000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>This bit enables the USB loopback test.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_DIG_TST0</name>
              <description>Mode control for USB loopback test</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_DIG_TST1</name>
              <description>Mode control for USB loopback test</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_HS_MODE</name>
              <description>Select HS or FS mode for USB loopback testing</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_LS_MODE</name>
              <description>Set to value 1&apos;b1 to choose LS for USB loopback testing, set to value 1&apos;b0 to choose HS or FS mode which is defined by TSTI1_TX_HS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_EN</name>
              <description>Enable TX for USB loopback test.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_HIZ</name>
              <description>Sets TX Hi-Z for USB loopback test.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMO_DIG_TST0</name>
              <description>This read-only bit is a status bit for USB loopback test results</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UTMO_DIG_TST1</name>
              <description>This read-only bit is a status bit for USB loopback test</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTI_HSFS_MODE_EN</name>
              <description>Setting this bit field to value 1&apos;b1 will enable the loopback test to dynamically change the packet speed</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTPKT</name>
              <description>Selects the packet data byte used for USB loopback testing in Pulse mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_LOOPBACK_CLR</name>
          <description>USB PHY Loopback Control/Status Register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x550000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>This bit enables the USB loopback test.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_DIG_TST0</name>
              <description>Mode control for USB loopback test</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_DIG_TST1</name>
              <description>Mode control for USB loopback test</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_HS_MODE</name>
              <description>Select HS or FS mode for USB loopback testing</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_LS_MODE</name>
              <description>Set to value 1&apos;b1 to choose LS for USB loopback testing, set to value 1&apos;b0 to choose HS or FS mode which is defined by TSTI1_TX_HS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_EN</name>
              <description>Enable TX for USB loopback test.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_HIZ</name>
              <description>Sets TX Hi-Z for USB loopback test.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMO_DIG_TST0</name>
              <description>This read-only bit is a status bit for USB loopback test results</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UTMO_DIG_TST1</name>
              <description>This read-only bit is a status bit for USB loopback test</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTI_HSFS_MODE_EN</name>
              <description>Setting this bit field to value 1&apos;b1 will enable the loopback test to dynamically change the packet speed</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTPKT</name>
              <description>Selects the packet data byte used for USB loopback testing in Pulse mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_LOOPBACK_TOG</name>
          <description>USB PHY Loopback Control/Status Register</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x550000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>This bit enables the USB loopback test.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_DIG_TST0</name>
              <description>Mode control for USB loopback test</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_DIG_TST1</name>
              <description>Mode control for USB loopback test</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_HS_MODE</name>
              <description>Select HS or FS mode for USB loopback testing</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_LS_MODE</name>
              <description>Set to value 1&apos;b1 to choose LS for USB loopback testing, set to value 1&apos;b0 to choose HS or FS mode which is defined by TSTI1_TX_HS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_EN</name>
              <description>Enable TX for USB loopback test.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_TX_HIZ</name>
              <description>Sets TX Hi-Z for USB loopback test.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMO_DIG_TST0</name>
              <description>This read-only bit is a status bit for USB loopback test results</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UTMO_DIG_TST1</name>
              <description>This read-only bit is a status bit for USB loopback test</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTI_HSFS_MODE_EN</name>
              <description>Setting this bit field to value 1&apos;b1 will enable the loopback test to dynamically change the packet speed</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTPKT</name>
              <description>Selects the packet data byte used for USB loopback testing in Pulse mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_LOOPBACK_HSFSCNT</name>
          <description>USB PHY Loopback Packet Number Select Register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSTI_HS_NUMBER</name>
              <description>High speed packet number, used when USBPHY_USB1_LOOPBACK[TSTI_HSFS_MODE_EN] is set to value 1&apos;b1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTI_FS_NUMBER</name>
              <description>Full speed packet number, used when USBPHY_USB1_LOOPBACK[TSTI_HSFS_MODE_EN] is set to value 1&apos;b1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
